# Pandas: Data Manipulation

In [70]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Create DataFrame

In [71]:
columns = ['Transaction', 'Amount', 'Action', 'Date']

transact1 = pd.DataFrame([['NYCPizza', 3.45, "W", "06/07/2018"],
                          ['Jet Airways', 345.0, "W", "06/11/2018"]],columns = columns)

transact2 = pd.DataFrame([['Paycheck', 2300, "D", "06/15/2018"],
                          ['Rent', 800, "W", "06/30/2018"]], columns = columns)

transact3 = pd.DataFrame(dict(Transaction = ['Walmart', 'RA funding'],
                             Amount = [100, 4500], Action = ['W','D'],
                             Date = ['06/09/2018','06/29/2018']))

transact3

  Action  Amount        Date Transaction
0      W     100  06/09/2018     Walmart
1      D    4500  06/29/2018  RA funding

## Concatenate DataFrame

In [72]:
transact1.append(transact2)

   Transaction   Amount Action        Date
0     NYCPizza     3.45      W  06/07/2018
1  Jet Airways   345.00      W  06/11/2018
0     Paycheck  2300.00      D  06/15/2018
1         Rent   800.00      W  06/30/2018

In [73]:
all_transact = pd.concat([transact1, transact2, transact3], sort=True)

all_transact

  Action   Amount        Date  Transaction
0      W     3.45  06/07/2018     NYCPizza
1      W   345.00  06/11/2018  Jet Airways
0      D  2300.00  06/15/2018     Paycheck
1      W   800.00  06/30/2018         Rent
0      W   100.00  06/09/2018      Walmart
1      D  4500.00  06/29/2018   RA funding

## Join DataFrame

In [74]:
transact4 = pd.DataFrame(dict(Transaction = ['NYCPizza','Rent', 'Paycheck','Jet Airways'],
                               Activity = ['Debit','Credit','Debit','Credit']))
transact4

  Activity  Transaction
0    Debit     NYCPizza
1   Credit         Rent
2    Debit     Paycheck
3   Credit  Jet Airways

In [75]:
merge_inter = pd.merge(all_transact, transact4, on = 'Transaction')
merge_inter

  Action   Amount        Date  Transaction Activity
0      W     3.45  06/07/2018     NYCPizza    Debit
1      W   345.00  06/11/2018  Jet Airways   Credit
2      D  2300.00  06/15/2018     Paycheck    Debit
3      W   800.00  06/30/2018         Rent   Credit

In [76]:
all_transact = pd.merge(all_transact, transact4, on = 'Transaction', how = 'outer')
all_transact

  Action   Amount        Date  Transaction Activity
0      W     3.45  06/07/2018     NYCPizza    Debit
1      W   345.00  06/11/2018  Jet Airways   Credit
2      D  2300.00  06/15/2018     Paycheck    Debit
3      W   800.00  06/30/2018         Rent   Credit
4      W   100.00  06/09/2018      Walmart      NaN
5      D  4500.00  06/29/2018   RA funding      NaN

## Summarizing

In [77]:
type(all_transact)             # <class 'pandas.core.frame.DataFrame'>
all_transact.head()            # First 5 rows
all_transact.tail()            # Last 5 rows
print(all_transact.describe()) # Summerize all numeric columns (VERY POWERFUL!!)
print('--------------------')

all_transact.index             # Labels (0th column!)
all_transact.columns           # All the actual labels
all_transact.dtypes
all_transact.shape             # (6,5) Think of the frame as a matrix
all_transact.values            # Underlying Numpy array (Cool!)

# Summary of most of the previous commands
all_transact.info()

            Amount
count     6.000000
mean   1341.408333
std    1761.407335
min       3.450000
25%     161.250000
50%     572.500000
75%    1925.000000
max    4500.000000
--------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
Action         6 non-null object
Amount         6 non-null float64
Date           6 non-null object
Transaction    6 non-null object
Activity       4 non-null object
dtypes: float64(1), object(4)
memory usage: 288.0+ bytes

In [78]:
all_transact.describe(include = 'all')       # Summerize all columns
all_transact.describe(include = ['object'])  # limit to one type

       Action        Date Transaction Activity
count       6           6           6        4
unique      2           6           6        2
top         W  06/11/2018    Paycheck    Debit
freq        4           1           1        2

## Column Selection

In [79]:
all_transact['Amount']                   # Select a column
all_transact.Amount                      # Alternative way (using the DataFrame)
type(all_transact['Amount'])             # Series

# Multiple columns
new_cols = ['Amount','Activity']
all_transact[new_cols]
# or a direct way
all_transact[['Amount','Activity']]

    Amount Activity
0     3.45    Debit
1   345.00   Credit
2  2300.00    Debit
3   800.00   Credit
4   100.00      NaN
5  4500.00      NaN

## Rows Selection

In [80]:
# iloc (strictly integer position based)
df = all_transact.copy()
df.iloc[0]                           # First row
df.iloc[0,0]                         # Second item of first row
df.iloc[0,1] = 7.45
all_transact.shape

# Gives error
'''
for i in range(all_transact.shape[0]):
    row = df.iloc[i]
    row.Amount *= 10.0
'''

# ix supports mixed integer and label calls
df = all_transact.copy()
df.loc[0]
df.loc[0,'Amount']                    # or >> df.ix[0,1]

for i in range(df.shape[0]):
    df.loc[i,'Amount'] += 20.0
print(df)

  Action   Amount        Date  Transaction Activity
0      W    23.45  06/07/2018     NYCPizza    Debit
1      W   365.00  06/11/2018  Jet Airways   Credit
2      D  2320.00  06/15/2018     Paycheck    Debit
3      W   820.00  06/30/2018         Rent   Credit
4      W   120.00  06/09/2018      Walmart      NaN
5      D  4520.00  06/29/2018   RA funding      NaN

## Rows Selection / Filtering

In [81]:
# Logical filtering
print(all_transact[all_transact > 500])
print('-------------------------------')
print(all_transact[all_transact > 500].Transaction)

  Action  Amount        Date  Transaction Activity
0      W     NaN  06/07/2018     NYCPizza    Debit
1      W     NaN  06/11/2018  Jet Airways   Credit
2      D  2300.0  06/15/2018     Paycheck    Debit
3      W   800.0  06/30/2018         Rent   Credit
4      W     NaN  06/09/2018      Walmart      NaN
5      D  4500.0  06/29/2018   RA funding      NaN
-------------------------------
0       NYCPizza
1    Jet Airways
2       Paycheck
3           Rent
4        Walmart
5     RA funding
Name: Transaction, dtype: object

In [82]:
# Advanced logical filtering
all_transact[all_transact.Amount > 500][['Transaction', 'Date']]
all_transact[(all_transact.Amount > 500) | (all_transact.Action == 'D')]

  Action  Amount        Date Transaction Activity
2      D  2300.0  06/15/2018    Paycheck    Debit
3      W   800.0  06/30/2018        Rent   Credit
5      D  4500.0  06/29/2018  RA funding      NaN

In [83]:
all_transact[all_transact.Transaction.isin(['Rent','Walmart'])]

  Action  Amount        Date Transaction Activity
3      W   800.0  06/30/2018        Rent   Credit
4      W   100.0  06/09/2018     Walmart      NaN

## Sorting

In [84]:
df = all_transact.copy()

df.Amount.sort_values()                          # only for series
df.sort_values(by = 'Amount')                    # by a specific column
df.sort_values(by = 'Action', ascending = False)
df.sort_values(by = ['Activity','Action'])
df.sort_values(by = ['Activity','Action'], inplace = True) # Modify df
df

  Action   Amount        Date  Transaction Activity
1      W   345.00  06/11/2018  Jet Airways   Credit
3      W   800.00  06/30/2018         Rent   Credit
2      D  2300.00  06/15/2018     Paycheck    Debit
0      W     3.45  06/07/2018     NYCPizza    Debit
5      D  4500.00  06/29/2018   RA funding      NaN
4      W   100.00  06/09/2018      Walmart      NaN

## Reshaping by Pivoting

In [85]:
# Unpivot from wide to stacked format
stacked = pd.melt(all_transact , id_vars = "Transaction")
stacked

    Transaction  variable       value
0      NYCPizza    Action           W
1   Jet Airways    Action           W
2      Paycheck    Action           D
3          Rent    Action           W
4       Walmart    Action           W
5    RA funding    Action           D
6      NYCPizza    Amount        3.45
7   Jet Airways    Amount         345
8      Paycheck    Amount        2300
9          Rent    Amount         800
10      Walmart    Amount         100
11   RA funding    Amount        4500
12     NYCPizza      Date  06/07/2018
13  Jet Airways      Date  06/11/2018
14     Paycheck      Date  06/15/2018
15         Rent      Date  06/30/2018
16      Walmart      Date  06/09/2018
17   RA funding      Date  06/29/2018
18     NYCPizza  Activity       Debit
19  Jet Airways  Activity      Credit
20     Paycheck  Activity       Debit
21         Rent  Activity      Credit
22      Walmart  Activity         NaN
23   RA funding  Activity         NaN

In [86]:
stacked.pivot(index = 'Transaction', columns = 'variable', values = 'value')

variable    Action Activity Amount        Date
Transaction
Jet Airways      W   Credit    345  06/11/2018
NYCPizza         W    Debit   3.45  06/07/2018
Paycheck         D    Debit   2300  06/15/2018
RA funding       D      NaN   4500  06/29/2018
Rent             W   Credit    800  06/30/2018
Walmart          W      NaN    100  06/09/2018

## Quality Check

### Remove Duplicate Data

In [87]:
df = all_transact.append(df.iloc[1], ignore_index = True) # Add another entry
df.duplicated()                   # Trus if data is duplicate
df[df.duplicated()]               # Duplicated data
df.duplicated(['Amount','Action']).sum()
df.drop_duplicates()              # Drop duplicates

  Action   Amount        Date  Transaction Activity
0      W     3.45  06/07/2018     NYCPizza    Debit
1      W   345.00  06/11/2018  Jet Airways   Credit
2      D  2300.00  06/15/2018     Paycheck    Debit
3      W   800.00  06/30/2018         Rent   Credit
4      W   100.00  06/09/2018      Walmart      NaN
5      D  4500.00  06/29/2018   RA funding      NaN

### Missing Data

In [88]:
df = all_transact.copy()

df.describe(include = 'all')   # Missing values are 'NaN'

# Find missing values (series)
df.Activity.isnull()           # True if missing
df.Activity.notnull()          # True if not missing
df[df.Activity.isnull()]       # Only rows with missing values
df.Activity.isnull().sum()     # Total count

# Find missing values in a DataFrame
df.isnull()                    # Matrix of Truths
df.isnull().sum()              # Missing values (every column)

Action         0
Amount         0
Date           0
Transaction    0
Activity       2
dtype: int64

In [89]:
# Drop missing values (IMPORTANT!!)
df.dropna()                    # Drop a row if any value is missing
df.dropna(how = 'all')         # Drop only if all values are missing

  Action   Amount        Date  Transaction Activity
0      W     3.45  06/07/2018     NYCPizza    Debit
1      W   345.00  06/11/2018  Jet Airways   Credit
2      D  2300.00  06/15/2018     Paycheck    Debit
3      W   800.00  06/30/2018         Rent   Credit
4      W   100.00  06/09/2018      Walmart      NaN
5      D  4500.00  06/29/2018   RA funding      NaN

In [90]:
# Fill in the missing values
df.loc[df.Activity.isnull(),'Activity'] = 'Unknown'
df

  Action   Amount        Date  Transaction Activity
0      W     3.45  06/07/2018     NYCPizza    Debit
1      W   345.00  06/11/2018  Jet Airways   Credit
2      D  2300.00  06/15/2018     Paycheck    Debit
3      W   800.00  06/30/2018         Rent   Credit
4      W   100.00  06/09/2018      Walmart  Unknown
5      D  4500.00  06/29/2018   RA funding  Unknown

## Rename Values

In [91]:
print(df.columns)
df.columns = ['Action', 'Any_cents', 'Date', 'Transaction', 'Card_type']
df.Card_type = df.Card_type.map({'Debit':'Reliable', 'Credit':'Unreliable', 'Unknown':'Info_missing'})
print(df)
assert df.Card_type.isnull().sum() == 0       # Gives error if not True (IMPORTANT!!)

Index(['Action', 'Amount', 'Date', 'Transaction', 'Activity'], dtype='object')
  Action  Any_cents        Date  Transaction     Card_type
0      W       3.45  06/07/2018     NYCPizza      Reliable
1      W     345.00  06/11/2018  Jet Airways    Unreliable
2      D    2300.00  06/15/2018     Paycheck      Reliable
3      W     800.00  06/30/2018         Rent    Unreliable
4      W     100.00  06/09/2018      Walmart  Info_missing
5      D    4500.00  06/29/2018   RA funding  Info_missing

## Outliners

In [92]:
size = pd.Series(np.random.normal(loc = 100, size = 30, scale = 10))
print('Before outliners:', size.mean())
size[:3] += 1000      # Make them outliners for the following examples
print('After outliers:', size.mean())
size.std()

Before outliners: 99.18555190849271
After outliers: 199.18555190849273

307.76934565840116

### Parametric Statistics (Mean)

In [93]:
size_outl = size.copy()
size_outl.std()

##########################################################
# Authors Probably didn't shift the variable by mean
# Here's my implementation
##########################################################

# Removing the outliners by removing values beyond 3 sigma
size_outl[(size_outl.mean()+(size_outl-size_outl.mean()).abs()) < 3*size_outl.std()].mean()

98.34956909595982

### Non-parametric Statistics (Median)

In [94]:
mad = 1.4826 * np.median(np.abs(size - size.median()))
size_outl_mad = size.copy()

# I don't understand this implementation
size_outl_mad[(size_outl_mad-size_outl_mad.median()).abs() > 3 * mad] = size.median()
size_outl_mad.mean()

98.27076964443513

## Groupby

In [95]:
# Make two or more groups based an an attribute
for grp, data in all_transact.groupby("Action"):
    print(grp, data)

D   Action  Amount        Date Transaction Activity
2      D  2300.0  06/15/2018    Paycheck    Debit
5      D  4500.0  06/29/2018  RA funding      NaN
W   Action  Amount        Date  Transaction Activity
0      W    3.45  06/07/2018     NYCPizza    Debit
1      W  345.00  06/11/2018  Jet Airways   Credit
3      W  800.00  06/30/2018         Rent   Credit
4      W  100.00  06/09/2018      Walmart      NaN

## File I/O

### csv

In [96]:
# Save a file in a temporary directory
import tempfile, os.path
tmpdir = tempfile.gettempdir()
csv_file = os.path.join(tmpdir, "all_transact.csv")
all_transact.to_csv(csv_file)

### Read csv from url

In [97]:
url = 'https://raw.githubusercontent.com/neurospin/pystatsml/master/datasets/salary_table.csv'
salary = pd.read_csv(url)
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 4 columns):
salary        46 non-null int64
experience    46 non-null int64
education     46 non-null object
management    46 non-null object
dtypes: int64(2), object(2)
memory usage: 1.5+ KB

### Excel

In [98]:
xls_file = os.path.join(tmpdir, "all_transact.xlsx")
all_transact.to_excel(xls_file, sheet_name = 'all_transact', index = False)

pd.read_excel(xls_file, sheet_name = 'all_transact')

  Action   Amount        Date  Transaction Activity
0      W     3.45  06/07/2018     NYCPizza    Debit
1      W   345.00  06/11/2018  Jet Airways   Credit
2      D  2300.00  06/15/2018     Paycheck    Debit
3      W   800.00  06/30/2018         Rent   Credit
4      W   100.00  06/09/2018      Walmart      NaN
5      D  4500.00  06/29/2018   RA funding      NaN

In [99]:
with pd.ExcelWriter(xls_file) as writer:
    all_transact.to_excel(writer, sheet_name = 'all_transact', index = False)
    df.to_excel(writer, sheet_name = 'Amount', index = False)
    
print(pd.read_excel(xls_file, sheet_name = 'all_transact'))    
print('----------------------------------------------------------')
print(pd.read_excel(xls_file, sheet_name = 'Amount'))

  Action   Amount        Date  Transaction Activity
0      W     3.45  06/07/2018     NYCPizza    Debit
1      W   345.00  06/11/2018  Jet Airways   Credit
2      D  2300.00  06/15/2018     Paycheck    Debit
3      W   800.00  06/30/2018         Rent   Credit
4      W   100.00  06/09/2018      Walmart      NaN
5      D  4500.00  06/29/2018   RA funding      NaN
----------------------------------------------------------
  Action  Any_cents        Date  Transaction     Card_type
0      W       3.45  06/07/2018     NYCPizza      Reliable
1      W     345.00  06/11/2018  Jet Airways    Unreliable
2      D    2300.00  06/15/2018     Paycheck      Reliable
3      W     800.00  06/30/2018         Rent    Unreliable
4      W     100.00  06/09/2018      Walmart  Info_missing
5      D    4500.00  06/29/2018   RA funding  Info_missing